       01 APPOINTMENT-DATE-PARAMS.
          05 ADP-INPUT-DATE          PIC 9(8).
          05 ADP-SECOND-DATE         PIC 9(8).
          05 ADP-RECURRENCE          PIC X.
          05 ADP-ANCHOR-DAY          PIC 9(2).
          05 ADP-VALID               PIC X.
          05 ADP-OUTPUT-DATE         PIC 9(8).
          05 ADP-ISO-YEAR            PIC 9(4).
          05 ADP-ISO-WEEK            PIC 9(2).
          05 ADP-DAY-NUMBER          PIC S9(9) COMP-5.
