       01 APPOINTMENT-CONFIG.
          05 AC-DATA-FILE            PIC X(256).
          05 AC-BACKUP-FILE          PIC X(256).
          05 AC-SAFETY-FILE          PIC X(256).
          05 AC-AUDIT-FILE           PIC X(256).
          05 AC-PRINT-FILE           PIC X(256).
          05 AC-LIST-PRINT-FILE      PIC X(256).
          05 AC-CSV-FILE             PIC X(256).
          05 AC-ICAL-FILE            PIC X(256).
          05 AC-LOCK-FILE            PIC X(256).
          05 AC-LINES-PER-PAGE       PIC 9(3).
          05 AC-CANCEL-RETENTION     PIC 9(4).
